[DLC07_Notes_MissingMoneyGuy DisAbstractItem]
m_ItemName="Skeeves is Gone"
m_PluralItemName=""
m_Description="It looks like Skeeves ain’t coming back from his patrol, it’s been six days now. Don’t get me wrong, I ain’t grieving ‘cause Skeeves and me didn’t see eye-to-eye on many things, but it makes me sad because he swore he was bringing back a tremendous stash of coins he knew about up in the dried out waterway. I figured I’d part him from all those coins in a few card games. But that ain’t to be. Who knows, if that water ever comes on again it just may flush him on out. But I doubt it. When you get off duty tonight we need to drink a toast to ole Skeeves."

